from aiogram import html




start = f"""🎖 به میدان خوش آمدی، {html.bold("فرمانده!")}

{html.bold("از این لحظه، تصمیم‌های تو سرنوشت کشورت را تعیین می‌کنند.")}

🌍 انتخاب کن
• کشور خودت را بساز و توسعه بده
• منابع جمع‌آوری کن
• ارتشت را قدرتمند کن
• با دیگر کشورها مذاکره و معامله کن
• اتحاد تشکیل بده یا وارد جنگ شو
• قلمروت را گسترش بده

⚠️ اینجا هر تصمیمی پیامد خودش را دارد.

برای شروع، روی دکمه «شروع فرمانروایی 🤴🏻» بزن."""



register_country = f"""{html.bold("👑 فرمانروا، لحظه آغاز فرا رسیده است!")}

سرزمینی در انتظار توست؛
اما هنوز اسمی ندارد...

اسمی که انتخاب می‌کنی، از این پس، بر نقشه این جهان ثبت خواهد شد.

{html.bold("🏰 نام امپراتوری خود را وارد کن:")}
"""

def register_country_accepted(country_name: str):
    return f"""👑 اسم امپراتوریت آماده است!

اسم انتخاب‌شده:
{html.pre(f"🌍 {country_name}") }

{html.bold("آیا این نام را تأیید می‌کنی؟")}
⚠️ پس از تأیید، این نام به عنوان نام رسمی امپراتوریت ثبت خواهد شد.
"""

